Revit 2024 API
ParameterTypeId.GridCenterSegmentWeight Property
 "Center Segment Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId GridCenterSegmentWeight { get; }
Visual Basic
Public Shared ReadOnly Property GridCenterSegmentWeight As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ GridCenterSegmentWeight {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace